books_app/app/controllers/books_controller.rb

  def index
    @books = Book.page(params[:page]).per(SHOW_PER_PAGE)
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "四月は君の嘘"], ["memo", "ピアニストの少年とバイオリニストの少女による音楽と青春の話"], ["created_at", "2019-03-25 02:24:09.763392"], ["updated_at", "2019-03-25 02:24:09.763392"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "picture" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["picture", "150x150_square_1490753.jpg"], ["updated_at", "2019-03-25 04:27:48.156036"], ["id", 1]]